MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1717/mcu.h
extern volatile DAC2CON0bits_t DAC2CON0bits __at(0x11A);
// bitfield macros
#define _DAC2CON0_NSS_POSN                                  0x0
#define _DAC2CON0_NSS_POSITION                              0x0
#define _DAC2CON0_NSS_SIZE                                  0x1
#define _DAC2CON0_NSS_LENGTH                                0x1
#define _DAC2CON0_NSS_MASK                                  0x1
#define _DAC2CON0_PSS_POSN                                  0x2
#define _DAC2CON0_PSS_POSITION                              0x2
#define _DAC2CON0_PSS_SIZE                                  0x2
#define _DAC2CON0_PSS_LENGTH                                0x2
#define _DAC2CON0_PSS_MASK                                  0xC
#define _DAC2CON0_OE2_POSN                                  0x4
#define _DAC2CON0_OE2_POSITION                              0x4
#define _DAC2CON0_OE2_SIZE                                  0x1
#define _DAC2CON0_OE2_LENGTH                                0x1
#define _DAC2CON0_OE2_MASK                                  0x10
#define _DAC2CON0_OE1_POSN                                  0x5
#define _DAC2CON0_OE1_POSITION                              0x5
#define _DAC2CON0_OE1_SIZE                                  0x1
#define _DAC2CON0_OE1_LENGTH                                0x1
#define _DAC2CON0_OE1_MASK                                  0x20
#define _DAC2CON0_EN_POSN                                   0x7
#define _DAC2CON0_EN_POSITION                               0x7
#define _DAC2CON0_EN_SIZE                                   0x1
#define _DAC2CON0_EN_LENGTH                                 0x1
#define _DAC2CON0_EN_MASK                                   0x80
#define _DAC2CON0_PSS0_POSN                                 0x2
#define _DAC2CON0_PSS0_POSITION                             0x2
#define _DAC2CON0_PSS0_SIZE                                 0x1
#define _DAC2CON0_PSS0_LENGTH                               0x1
#define _DAC2CON0_PSS0_MASK                                 0x4
#define _DAC2CON0_PSS1_POSN                                 0x3
#define _DAC2CON0_PSS1_POSITION                             0x3
#define _DAC2CON0_PSS1_SIZE                                 0x1
#define _DAC2CON0_PSS1_LENGTH                               0x1
#define _DAC2CON0_PSS1_MASK                                 0x8
#define _DAC2CON0_DACNSS_POSN                               0x0
#define _DAC2CON0_DACNSS_POSITION                           0x0
#define _DAC2CON0_DACNSS_SIZE                               0x1
#define _DAC2CON0_DACNSS_LENGTH                             0x1
#define _DAC2CON0_DACNSS_MASK                               0x1
#define _DAC2CON0_DACPSS_POSN                               0x2
#define _DAC2CON0_DACPSS_POSITION                           0x2
#define _DAC2CON0_DACPSS_SIZE                               0x2
#define _DAC2CON0_DACPSS_LENGTH                             0x2
#define _DAC2CON0_DACPSS_MASK                               0xC
#define _DAC2CON0_DACOE2_POSN                               0x4
#define _DAC2CON0_DACOE2_POSITION                           0x4
#define _DAC2CON0_DACOE2_SIZE                               0x1
#define _DAC2CON0_DACOE2_LENGTH                             0x1
#define _DAC2CON0_DACOE2_MASK                               0x10
#define _DAC2CON0_DACOE1_POSN                               0x5
#define _DAC2CON0_DACOE1_POSITION                           0x5
#define _DAC2CON0_DACOE1_SIZE                               0x1
#define _DAC2CON0_DACOE1_LENGTH                             0x1
#define _DAC2CON0_DACOE1_MASK                               0x20
#define _DAC2CON0_DACEN_POSN                                0x7
#define _DAC2CON0_DACEN_POSITION                            0x7
#define _DAC2CON0_DACEN_SIZE                                0x1
#define _DAC2CON0_DACEN_LENGTH                              0x1
#define _DAC2CON0_DACEN_MASK                                0x80
#define _DAC2CON0_DACPSS0_POSN                              0x2
#define _DAC2CON0_DACPSS0_POSITION                          0x2
#define _DAC2CON0_DACPSS0_SIZE                              0x1
#define _DAC2CON0_DACPSS0_LENGTH                            0x1
#define _DAC2CON0_DACPSS0_MASK                              0x4
#define _DAC2CON0_DACPSS1_POSN                              0x3
#define _DAC2CON0_DACPSS1_POSITION                          0x3
#define _DAC2CON0_DACPSS1_SIZE                              0x1
#define _DAC2CON0_DACPSS1_LENGTH                            0x1
#define _DAC2CON0_DACPSS1_MASK                              0x8
#define _DAC2CON0_DAC2NSS_POSN                              0x0
#define _DAC2CON0_DAC2NSS_POSITION                          0x0
#define _DAC2CON0_DAC2NSS_SIZE                              0x1
#define _DAC2CON0_DAC2NSS_LENGTH                            0x1
#define _DAC2CON0_DAC2NSS_MASK                              0x1
#define _DAC2CON0_DAC2PSS_POSN                              0x2
#define _DAC2CON0_DAC2PSS_POSITION                          0x2
#define _DAC2CON0_DAC2PSS_SIZE                              0x2
#define _DAC2CON0_DAC2PSS_LENGTH                            0x2
#define _DAC2CON0_DAC2PSS_MASK                              0xC
#define _DAC2CON0_DAC2OE2_POSN                              0x4
#define _DAC2CON0_DAC2OE2_POSITION                          0x4
#define _DAC2CON0_DAC2OE2_SIZE                              0x1
#define _DAC2CON0_DAC2OE2_LENGTH                            0x1
#define _DAC2CON0_DAC2OE2_MASK                              0x10
#define _DAC2CON0_DAC2OE1_POSN                              0x5
#define _DAC2CON0_DAC2OE1_POSITION                          0x5
#define _DAC2CON0_DAC2OE1_SIZE                              0x1
#define _DAC2CON0_DAC2OE1_LENGTH                            0x1
#define _DAC2CON0_DAC2OE1_MASK                              0x20
#define _DAC2CON0_DAC2EN_POSN                               0x7
#define _DAC2CON0_DAC2EN_POSITION                           0x7
#define _DAC2CON0_DAC2EN_SIZE                               0x1
#define _DAC2CON0_DAC2EN_LENGTH                             0x1
#define _DAC2CON0_DAC2EN_MASK                               0x80
#define _DAC2CON0_DAC2PSS0_POSN                             0x2
#define _DAC2CON0_DAC2PSS0_POSITION                         0x2
#define _DAC2CON0_DAC2PSS0_SIZE                             0x1
#define _DAC2CON0_DAC2PSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS0_MASK                             0x4
#define _DAC2CON0_DAC2PSS1_POSN                             0x3
#define _DAC2CON0_DAC2PSS1_POSITION                         0x3
#define _DAC2CON0_DAC2PSS1_SIZE                             0x1
#define _DAC2CON0_DAC2PSS1_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS1_MASK                             0x8

// Register: DAC2REF
#define DAC2REF DAC2REF
extern volatile unsigned char           DAC2REF             __at(0x11B);
#ifndef _LIB_BUILD
asm("DAC2REF equ 011Bh");
#endif
// aliases
extern volatile unsigned char           DAC2CON1            __at(0x11B);
#ifndef _LIB_BUILD
asm("DAC2CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC2R                  :5;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
    };
    struct {
        unsigned DAC2REF0               :1;
        unsigned DAC2REF1               :1;
        unsigned DAC2REF2               :1;
        unsigned DAC2REF3               :1;
        unsigned DAC2REF4               :1;
        unsigned DAC2REF5               :1;
    };
} DAC2REFbits_t;
