MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1717/mcu.h
extern volatile __bit                   CCP1Y               __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,2)
// PIE3<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR3,3)
// PIE3<COGIE>
extern volatile __bit                   COGIE               __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 COGIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<COGIF>
extern volatile __bit                   COGIF               __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 COGIF_bit           _BIT_ACCESS(PIR3,5)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// DAC1CON1<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1CON1,5)
// DAC1CON1<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1CON1,6)
// DAC1CON1<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1CON1,7)
// DAC2CON0<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON0,7)
// DAC2CON0<DAC2NSS>
extern volatile __bit                   DAC2NSS             __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 DAC2NSS_bit         _BIT_ACCESS(DAC2CON0,0)
// DAC2CON0<DAC2OE1>
extern volatile __bit                   DAC2OE1             __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 DAC2OE1_bit         _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<DAC2OE2>
extern volatile __bit                   DAC2OE2             __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 DAC2OE2_bit         _BIT_ACCESS(DAC2CON0,4)
// DAC2CON0<DAC2PSS0>
extern volatile __bit                   DAC2PSS0            __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 DAC2PSS0_bit        _BIT_ACCESS(DAC2CON0,2)
// DAC2CON0<DAC2PSS1>
extern volatile __bit                   DAC2PSS1            __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 DAC2PSS1_bit        _BIT_ACCESS(DAC2CON0,3)
// DAC2REF<DAC2R0>
extern volatile __bit                   DAC2R0              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2REF,0)
// DAC2REF<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2REF,1)
// DAC2REF<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2REF,2)
// DAC2REF<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2REF,3)
// DAC2REF<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2REF,4)
// DAC2REF<DAC2REF0>
extern volatile __bit                   DAC2REF0            __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 DAC2REF0_bit        _BIT_ACCESS(DAC2REF,0)
// DAC2REF<DAC2REF1>
extern volatile __bit                   DAC2REF1            __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 DAC2REF1_bit        _BIT_ACCESS(DAC2REF,1)
// DAC2REF<DAC2REF2>
extern volatile __bit                   DAC2REF2            __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 DAC2REF2_bit        _BIT_ACCESS(DAC2REF,2)
// DAC2REF<DAC2REF3>
extern volatile __bit                   DAC2REF3            __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 DAC2REF3_bit        _BIT_ACCESS(DAC2REF,3)
// DAC2REF<DAC2REF4>
extern volatile __bit                   DAC2REF4            __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 DAC2REF4_bit        _BIT_ACCESS(DAC2REF,4)
// DAC2REF<DAC2REF5>
extern volatile __bit                   DAC2REF5            __at(0x8DD);	// @ (0x11B * 8 + 5)
#define                                 DAC2REF5_bit        _BIT_ACCESS(DAC2REF,5)
// DAC1CON0<DACOE0>
extern volatile __bit                   DACOE0              __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 DACOE0_bit          _BIT_ACCESS(DAC1CON0,4)
// DAC2CON0<DACOE2>
extern volatile __bit                   DACOE2              __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 DACOE2_bit          _BIT_ACCESS(DAC2CON0,4)
// DAC1CON1<DACR5>
extern volatile __bit                   DACR5               __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 DACR5_bit           _BIT_ACCESS(DAC1CON1,5)
// DAC1CON1<DACR6>
extern volatile __bit                   DACR6               __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 DACR6_bit           _BIT_ACCESS(DAC1CON1,6)
// DAC1CON1<DACR7>
extern volatile __bit                   DACR7               __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 DACR7_bit           _BIT_ACCESS(DAC1CON1,7)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// COG1ASD0<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1ASD1<G1AS0E>
extern volatile __bit                   G1AS0E              __at(0x34F0);	// @ (0x69E * 8 + 0)
#define                                 G1AS0E_bit          _BIT_ACCESS(COG1ASD1,0)
// COG1ASD1<G1AS1E>
extern volatile __bit                   G1AS1E              __at(0x34F1);	// @ (0x69E * 8 + 1)
#define                                 G1AS1E_bit          _BIT_ACCESS(COG1ASD1,1)
// COG1ASD1<G1AS2E>
extern volatile __bit                   G1AS2E              __at(0x34F2);	// @ (0x69E * 8 + 2)
#define                                 G1AS2E_bit          _BIT_ACCESS(COG1ASD1,2)
// COG1ASD1<G1AS3E>
extern volatile __bit                   G1AS3E              __at(0x34F3);	// @ (0x69E * 8 + 3)
#define                                 G1AS3E_bit          _BIT_ACCESS(COG1ASD1,3)
// COG1ASD0<G1ASDAC0>
extern volatile __bit                   G1ASDAC0            __at(0x34EA);	// @ (0x69D * 8 + 2)
#define                                 G1ASDAC0_bit        _BIT_ACCESS(COG1ASD0,2)
// COG1ASD0<G1ASDAC1>
extern volatile __bit                   G1ASDAC1            __at(0x34EB);	// @ (0x69D * 8 + 3)
#define                                 G1ASDAC1_bit        _BIT_ACCESS(COG1ASD0,3)
// COG1ASD0<G1ASDBD0>
extern volatile __bit                   G1ASDBD0            __at(0x34EC);	// @ (0x69D * 8 + 4)
#define                                 G1ASDBD0_bit        _BIT_ACCESS(COG1ASD0,4)
// COG1ASD0<G1ASDBD1>
extern volatile __bit                   G1ASDBD1            __at(0x34ED);	// @ (0x69D * 8 + 5)
#define                                 G1ASDBD1_bit        _BIT_ACCESS(COG1ASD0,5)
// COG1ASD0<G1ASE>
extern volatile __bit                   G1ASE               __at(0x34EF);	// @ (0x69D * 8 + 7)
#define                                 G1ASE_bit           _BIT_ACCESS(COG1ASD0,7)
// COG1BLKF<G1BLKF0>
extern volatile __bit                   G1BLKF0             __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 G1BLKF0_bit         _BIT_ACCESS(COG1BLKF,0)
// COG1BLKF<G1BLKF1>
extern volatile __bit                   G1BLKF1             __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 G1BLKF1_bit         _BIT_ACCESS(COG1BLKF,1)
// COG1BLKF<G1BLKF2>
extern volatile __bit                   G1BLKF2             __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 G1BLKF2_bit         _BIT_ACCESS(COG1BLKF,2)
// COG1BLKF<G1BLKF3>
extern volatile __bit                   G1BLKF3             __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 G1BLKF3_bit         _BIT_ACCESS(COG1BLKF,3)
// COG1BLKF<G1BLKF4>
extern volatile __bit                   G1BLKF4             __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 G1BLKF4_bit         _BIT_ACCESS(COG1BLKF,4)
// COG1BLKF<G1BLKF5>
extern volatile __bit                   G1BLKF5             __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 G1BLKF5_bit         _BIT_ACCESS(COG1BLKF,5)
// COG1BLKR<G1BLKR0>
extern volatile __bit                   G1BLKR0             __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 G1BLKR0_bit         _BIT_ACCESS(COG1BLKR,0)
// COG1BLKR<G1BLKR1>
extern volatile __bit                   G1BLKR1             __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 G1BLKR1_bit         _BIT_ACCESS(COG1BLKR,1)
// COG1BLKR<G1BLKR2>
extern volatile __bit                   G1BLKR2             __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 G1BLKR2_bit         _BIT_ACCESS(COG1BLKR,2)
// COG1BLKR<G1BLKR3>
extern volatile __bit                   G1BLKR3             __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G1BLKR3_bit         _BIT_ACCESS(COG1BLKR,3)
// COG1BLKR<G1BLKR4>
extern volatile __bit                   G1BLKR4             __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G1BLKR4_bit         _BIT_ACCESS(COG1BLKR,4)
// COG1BLKR<G1BLKR5>
extern volatile __bit                   G1BLKR5             __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 G1BLKR5_bit         _BIT_ACCESS(COG1BLKR,5)
// COG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1CS1>
extern volatile __bit                   G1CS1               __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON0,4)
// COG1DBF<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DBF,0)
// COG1DBF<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DBF,1)
// COG1DBF<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DBF,2)
// COG1DBF<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DBF,3)
// COG1DBF<G1DBF4>
extern volatile __bit                   G1DBF4              __at(0x34B4);	// @ (0x696 * 8 + 4)
#define                                 G1DBF4_bit          _BIT_ACCESS(COG1DBF,4)
// COG1DBF<G1DBF5>
extern volatile __bit                   G1DBF5              __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 G1DBF5_bit          _BIT_ACCESS(COG1DBF,5)
// COG1DBR<G1DBR0>
extern volatile __bit                   G1DBR0              __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 G1DBR0_bit          _BIT_ACCESS(COG1DBR,0)
// COG1DBR<G1DBR1>
extern volatile __bit                   G1DBR1              __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 G1DBR1_bit          _BIT_ACCESS(COG1DBR,1)
// COG1DBR<G1DBR2>
extern volatile __bit                   G1DBR2              __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 G1DBR2_bit          _BIT_ACCESS(COG1DBR,2)
// COG1DBR<G1DBR3>
extern volatile __bit                   G1DBR3              __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 G1DBR3_bit          _BIT_ACCESS(COG1DBR,3)
// COG1DBR<G1DBR4>
extern volatile __bit                   G1DBR4              __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 G1DBR4_bit          _BIT_ACCESS(COG1DBR,4)
// COG1DBR<G1DBR5>
extern volatile __bit                   G1DBR5              __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 G1DBR5_bit          _BIT_ACCESS(COG1DBR,5)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FDBS>
extern volatile __bit                   G1FDBS              __at(0x34C6);	// @ (0x698 * 8 + 6)
#define                                 G1FDBS_bit          _BIT_ACCESS(COG1CON1,6)
// COG1FIS<G1FIS0>
extern volatile __bit                   G1FIS0              __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 G1FIS0_bit          _BIT_ACCESS(COG1FIS,0)
// COG1FIS<G1FIS1>
extern volatile __bit                   G1FIS1              __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 G1FIS1_bit          _BIT_ACCESS(COG1FIS,1)
// COG1FIS<G1FIS2>
extern volatile __bit                   G1FIS2              __at(0x34DA);	// @ (0x69B * 8 + 2)
#define                                 G1FIS2_bit          _BIT_ACCESS(COG1FIS,2)
// COG1FIS<G1FIS3>
extern volatile __bit                   G1FIS3              __at(0x34DB);	// @ (0x69B * 8 + 3)
#define                                 G1FIS3_bit          _BIT_ACCESS(COG1FIS,3)
// COG1FIS<G1FIS4>
